//
//  ViewController.swift
//  Labka5
//
//  Created by Saltanat Nareshova on 07.03.2021.
//

import UIKit

class ViewController: UIViewController {

    @IBOutlet weak var story: UILabel!
    @IBOutlet weak var Kbtu: UIImageView!
    override func viewDidLoad() {
        super.viewDidLoad()
        Kbtu.image = UIImage.init(named: "1")
        story.text = "2001 жылы құрылған Қазақстан-Британ техникалық университеті (ҚБТУ), – халықаралық деңгейдегі ғылыми-техникалық элита дайындау саласындағы республиканың жетекші жоғары оқу орындарының бірі. Мұнда экономика, мұнай-газ өнеркәсібі, энергетика, кибернетика және геологиялық барлау салаларында озық білім алу үшін барлық жағдайлар жасалған. Білім сапасы, университеттің техникалық базасы, білікті профессор-оқытушылар құрамы көптеген жылдар бойы республикалық және халықаралық деңгейде жоғары бағаланады. ҚБТУ тоғыз жыл бойы республиканың жоғары оқу орындарының   Ұлттық рейтингіне сәйкес еліміздің үздік техникалық жоғары оқу орны болып танылады. 2018 жылы 'Атамекен' Ұлттық кәсіпкерлер палатасы ҚБТУ-ды Қазақстанның ең үздік IT-университеті деп атады.  ҚБТУ- Инжиниринг және технологиялар бойынша аккредиттеу кеңесінің (ABET) IT-бағыты бойынша Халықаралық аккредитацияны алған Қазақстандағы тұңғыш және бірегей жоғары оқу орны. Бұл түлектерге әлемнің ең үздік компанияларында: Google, Facebook, Twitter және т. б. жұмыс істеуге мүмкіндік береді."
        story.numberOfLines = 0
        story.translatesAutoresizingMaskIntoConstraints = false
    }
    override func viewDidLayoutSubviews() {
        story.sizeToFit()
    }
}

